{
  "title": "Troubleshooting Email Client Connection Issues",
  "subtitle": "Resolving common problems with Outlook, Thunderbird, and webmail access.",
  "metadata": {
    "Article ID": "KB-EML-001",
    "Category": "Software/Email",
    "Last Updated": "2025-07-16",
    "Author": "AI Assistant"
  },
  "sections": [
    {
      "title": "Overview",
      "content": [
        "This article provides step-by-step instructions to diagnose and resolve common email client connection problems, including issues with sending, receiving, or accessing email through desktop applications like Microsoft Outlook or Mozilla Thunderbird, and web-based email services."
      ]
    },
    {
      "title": "Symptoms",
      "content": [
        {
          "list": [
            {
              "title": "",
              "description": "Email client displays \"Disconnected\" or \"Needs Password\" message."
            },
            {
              "title": "",
              "description": "Unable to send or receive emails."
            },
            {
              "title": "",
              "description": "Error messages like \"Server not found,\" \"Connection timed out,\" or \"Authentication failed.\""
            },
            {
              "title": "",
              "description": "Webmail access issues (e.g., unable to log in, page not loading)."
            },
            {
              "title": "",
              "description": "Emails stuck in outbox."
            }
          ]
        }
      ]
    },
    {
      "title": "Cause",
      "content": [
        "Email connection issues can stem from various sources, including incorrect account settings, network connectivity problems, firewall/antivirus interference, or server-side outages. This guide will help you systematically check for these common causes."
      ]
    },
    {
      "title": "Solution",
      "content": [
        {
          "alert": {
            "title": "Before You Begin",
            "content": "Ensure your computer is connected to the internet and try accessing a website (e.g., google.com) to confirm basic network connectivity."
          }
        },
        {
          "list": [
            {
              "title": "Check Internet Connection:",
              "description": "Verify your device has an active internet connection. Try opening a web browser and navigating to a known website like <code>https://www.google.com</code>. If you cannot access websites, troubleshoot your network connection first."
            },
            {
              "title": "Verify Email Account Settings:",
              "description": "Incorrect server settings (IMAP/POP3, SMTP), port numbers, or encryption methods are common culprits. Refer to your email provider's documentation for the correct settings. For corporate email, contact your IT department."
            },
            {
              "title": "Check Password:",
              "description": "Confirm you are using the correct password. If you recently changed your email password, update it in your email client settings. Try logging into your webmail directly to rule out a password issue."
            },
            {
              "title": "Disable Firewall/Antivirus Temporarily:",
              "description": "Security software can sometimes block email client connections. Temporarily disable your firewall or antivirus software and try connecting. If this resolves the issue, configure your security software to allow your email client."
            },
            {
              "title": "Restart Email Client and Computer:",
              "description": "A simple restart can often resolve temporary glitches. Close your email client completely and reopen it. If the issue persists, restart your computer."
            },
            {
              "title": "Repair/Recreate Email Profile (Outlook Specific):",
              "description": "For Microsoft Outlook, a corrupted mail profile can cause connection issues. You can try repairing your existing profile or creating a new one via the Mail Setup (Outlook) in Control Panel."
            }
          ]
        },
        {
          "alert": {
            "title": "Important Note",
            "content": "Temporarily disabling security software should only be done for testing purposes. Re-enable it immediately after testing to protect your system."
          }
        }
      ]
    },
    {
      "title": "Command Line Network Test",
      "content": [
        "You can use thepingcommand to test connectivity to your email server:",
        {
          "code": "ping mail.example.com\n          telnet mail.example.com 993"
        },
        "Replacemail.example.comwith your actual email server address and993with the appropriate port (e.g., 587 for SMTP, 993 for IMAPS, 995 for POP3S)."
      ]
    },
    {
      "title": "Troubleshooting Table",
      "content": [
        {
          "table": [
            [
              "Issue",
              "Possible Cause",
              "Solution"
            ],
            [
              "\"Authentication Failed\"",
              "Incorrect username/password or server settings.",
              "Verify credentials and server settings. Enable 2FA app password if applicable."
            ],
            [
              "\"Connection Timed Out\"",
              "Network blockage, incorrect port, or server offline.",
              "Check firewall, verify port numbers, ping server address."
            ],
            [
              "Emails stuck in Outbox",
              "SMTP server issue, large attachment, or offline mode.",
              "Verify SMTP settings, reduce attachment size, ensure client is online."
            ]
          ]
        }
      ]
    },
    {
      "title": "Additional Resources",
      "content": [
        {
          "list": [
            {
              "title": "",
              "description": "<a href=\"#\">KB-NET-002: Diagnosing Network Connectivity Issues</a>"
            },
            {
              "title": "",
              "description": "<a href=\"#\">External Link: Microsoft Outlook Support</a>"
            },
            {
              "title": "",
              "description": "Contact IT Help Desk at extension 1234 or helpdesk@example.com"
            }
          ]
        }
      ]
    },
    {
      "title": "Verification",
      "content": [
        {
          "alert": {
            "title": "Success Indicators",
            "content": "You will know the issue is resolved when:Your email client connects successfully to the mail server.You can send and receive new emails without errors.No error messages related to email connection are displayed."
          }
        }
      ]
    },
    {
      "title": "Version History",
      "content": [
        {
          "table": [
            [
              "Version",
              "Date",
              "Changes",
              "Author"
            ],
            [
              "1.0",
              "2025-07-16",
              "Initial creation for email client troubleshooting.",
              "AI Assistant"
            ]
          ]
        }
      ]
    }
  ]
}